products/admin/fedexwsdl/RateRequest_ Intl_Return.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/rate/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <RateRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key>p7sPy4Sctm7XZ8gx</Key>
               <Password/>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>150067600</AccountNumber>
            <MeterNumber>1036920</MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>Basic Rate Request</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>crs</ServiceId>
            <Major>13</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2012-05-02T12:34:56-06:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>INTERNATIONAL_PRIORITY</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <TotalWeight>
               <Units>LB</Units>
               <Value>50</Value>
            </TotalWeight>
            <TotalInsuredValue>
               <Currency>USD</Currency>
               <Amount>100.00</Amount>
            </TotalInsuredValue>
            <Shipper>
               <Contact>
                  <PersonName>Komal</PersonName>
                  <CompanyName>WAPISENDER-WBUS1100</CompanyName>
                  <PhoneNumber>9012704839</PhoneNumber>
                  <EMailAddress>Komal_Kapate@syntelinc.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Sender_Address_Line1</StreetLines>
                  <StreetLines>Sender_Address_Line2</StreetLines>
                  <City>HAMBURG</City>
                  <StateOrProvinceCode>HH</StateOrProvinceCode>
                  <PostalCode>22415</PostalCode>
                  <CountryCode>DE</CountryCode>
               </Address>
            </Shipper>
            <Recipient>
               <Contact>
                  <PersonName>Komalh</PersonName>
                  <CompanyName>CSCSWAPI-WBUS1100</CompanyName>
                  <PhoneNumber>9018549236</PhoneNumber>
                  <EMailAddress>Ravikumar_Sharma@syntelinc.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Sender_Address_Line1</StreetLines>
                  <StreetLines>Sender_Address_Line2</StreetLines>
                  <City>MEMPHIS</City>
                  <StateOrProvinceCode>TN</StateOrProvinceCode>
                  <PostalCode>38118</PostalCode>
                  <CountryCode>US</CountryCode>
                  <CountryName>UNITED_STATES</CountryName>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>150067600</AccountNumber>
                     <Tins>
                        <TinType>BUSINESS_STATE</TinType>
                        <Number>123456</Number>
                     </Tins>
                     <Contact>
                        <ContactId>12345</ContactId>
                        <PersonName>Komalh</PersonName>
                     </Contact>
                     <Address>
                        <StreetLines>Sender_Address_Line1</StreetLines>
                        <StreetLines>Sender_Address_Line2</StreetLines>
                        <City>HAMBURG</City>
                        <StateOrProvinceCode>HH</StateOrProvinceCode>
                        <PostalCode>22415</PostalCode>
                        <CountryCode>DE</CountryCode>
                     </Address>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            <SpecialServicesRequested>
               <SpecialServiceTypes>RETURNS_CLEARANCE</SpecialServiceTypes>
            </SpecialServicesRequested>
            <CustomsClearanceDetail>
               <CustomsOptions>
                  <Type>TRIAL</Type>
               </CustomsOptions>
               <ImporterOfRecord>
                  <AccountNumber>150067600</AccountNumber>
                  <Contact>
                     <PersonName>Chinmay</PersonName>
                     <CompanyName>Fedex</CompanyName>
                     <PhoneNumber>1234567890</PhoneNumber>
                  </Contact>
                  <Address>
                     <StreetLines>Sender_Address_Line1</StreetLines>
                     <StreetLines>Sender_Address_Line2</StreetLines>
                     <City>HAMBURG</City>
                     <StateOrProvinceCode>HH</StateOrProvinceCode>
                     <PostalCode>22415</PostalCode>
                     <CountryCode>DE</CountryCode>
                  </Address>
               </ImporterOfRecord>
               <RecipientCustomsId>
                  <Type>COMPANY</Type>
                  <Value>STRING</Value>
               </RecipientCustomsId>
               <DutiesPayment>
                  <PaymentType>SENDER</PaymentType>
                  <Payor>
                     <ResponsibleParty>
                        <AccountNumber>150067600</AccountNumber>
                        <Contact>
                           <ContactId>CK1234</ContactId>
                           <PersonName>Chinmay</PersonName>
                           <CompanyName>Fedex</CompanyName>
                           <PhoneNumber>1234567890</PhoneNumber>
                        </Contact>
                        <Address>
                           <StreetLines>Sender_Address_Line1</StreetLines>
                           <StreetLines>Sender_Address_Line2</StreetLines>
                           <City>HAMBURG</City>
                           <StateOrProvinceCode>HH</StateOrProvinceCode>
                           <PostalCode>22415</PostalCode>
                           <CountryCode>DE</CountryCode>
                        </Address>
                     </ResponsibleParty>
                  </Payor>
               </DutiesPayment>
               <CustomsValue>
                  <Currency>USD</Currency>
                  <Amount>100.0</Amount>
               </CustomsValue>
               <InsuranceCharges>
                  <Currency>USD</Currency>
                  <Amount>100.0</Amount>
               </InsuranceCharges>
               <CommercialInvoice>
                  <Comments>vhdhjschscvhscvhscvs</Comments>
                  <SpecialInstructions>string</SpecialInstructions>
                  <DeclarationStatement>string</DeclarationStatement>
                  <PaymentTerms>string</PaymentTerms>
                  <Purpose>REPAIR_AND_RETURN</Purpose>
                  <OriginatorName>string</OriginatorName>
                  <TermsOfSale>FOB_OR_FCA</TermsOfSale>
               </CommercialInvoice>
               <Commodities>
                  <Name>string</Name>
                  <NumberOfPieces>1</NumberOfPieces>
                  <Description>string</Description>
                  <CountryOfManufacture>US</CountryOfManufacture>
                  <Weight>
                     <Units>LB</Units>
                     <Value>10.0</Value>
                  </Weight>
                  <Quantity>1</Quantity>
                  <QuantityUnits>HZ</QuantityUnits>
                  <UnitPrice>
                     <Currency>USD</Currency>
                     <Amount>100.0</Amount>
                  </UnitPrice>
                  <CustomsValue>
                     <Currency>USD</Currency>
                     <Amount>100.0</Amount>
                  </CustomsValue>
               </Commodities>
            </CustomsClearanceDetail>
            <LabelSpecification>
               <LabelFormatType>COMMON2D</LabelFormatType>
               <ImageType>PNG</ImageType>
               <LabelStockType>PAPER_4X6</LabelStockType>
            </LabelSpecification>
            <RateRequestTypes>ACCOUNT</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <GroupPackageCount>1</GroupPackageCount>
               <Weight>
                  <Units>LB</Units>
                  <Value>50.0</Value>
               </Weight>
               <Dimensions>
                  <Length>12</Length>
                  <Width>12</Width>
                  <Height>12</Height>
                  <Units>IN</Units>
               </Dimensions>
            </RequestedPackageLineItems>
         </RequestedShipment>
      </RateRequest>
   </soapenv:Body>
</soapenv:Envelope>